# Belajar pandas

# #01: Menyertakan prefix dan suffix pada kolom data frame

In [321]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [322]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  1  2  8  1
1  5  5  5  2  6
2  3  3  7  3  1
3  7  2  7  3  7
4  7  9  5  8  1

In [323]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [324]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        3        1        2        8        1
1        5        5        5        2        6
2        3        3        7        3        1
3        7        2        7        3        7
4        7        9        5        8        1

In [325]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        3        1        2        8        1
1        5        5        5        2        6
2        3        3        7        3        1
3        7        2        7        3        7
4        7        9        5        8        1

# #02: Pemilihan baris (rows selection) pada data frame

In [326]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  2  2  4  4
1  2  3  2  3  3
2  3  4  2  4  2
3  2  4  3  1  2
4  2  1  3  3  4
5  4  4  4  4  4
6  1  3  1  1  2
7  2  3  1  1  1
8  3  1  1  3  3
9  2  2  1  3  3

In [327]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  1  2  2  4  4
2  3  4  2  4  2
6  1  3  1  1  2
8  3  1  1  3  3

In [328]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  1  2  2  4  4
2  3  4  2  4  2
6  1  3  1  1  2
8  3  1  1  3  3

In [329]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
1  2  3  2  3  3
3  2  4  3  1  2
4  2  1  3  3  4
5  4  4  4  4  4
7  2  3  1  1  1
9  2  2  1  3  3

# #03: Konversi tipe data string ke numerik pada kolom data frame

In [330]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [331]:
df.dtypes

col1    object
col2    object
dtype: object

In [332]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [333]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [334]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

# #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [335]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          2.0          1    A
1 2000-01-01 01:00:00         18.0          8    B
2 2000-01-01 02:00:00          9.0          2    C
3 2000-01-01 03:00:00          5.0         17    D
4 2000-01-01 04:00:00         19.0         19    E

In [336]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [337]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          2.0          1
1         18.0          8
2          9.0          2
3          5.0         17
4         19.0         19

In [338]:
df.select_dtypes(include='float')

   bil_pecahan
0          2.0
1         18.0
2          9.0
3          5.0
4         19.0

In [339]:
df.select_dtypes(include='int')

   bil_bulat
0          1
1          8
2          2
3         17
4         19

In [340]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [341]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [342]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          2.0          1    A
1         18.0          8    B
2          9.0          2    C
3          5.0         17    D
4         19.0         19    E

# #05: Membalik urutan baris dan kolom pada data frame

In [343]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  9  4  5  5  6
1  5  3  9  1  7
2  3  1  6  8  6
3  4  4  3  9  9
4  3  4  7  2  5

In [344]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  6  5  5  4  9
1  7  1  9  3  5
2  6  8  6  1  3
3  9  9  3  4  4
4  5  2  7  4  3

In [345]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  3  4  7  2  5
3  4  4  3  9  9
2  3  1  6  8  6
1  5  3  9  1  7
0  9  4  5  5  6

In [346]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  4  7  2  5
1  4  4  3  9  9
2  3  1  6  8  6
3  5  3  9  1  7
4  9  4  5  5  6

# #06: Mengganti nama (label) kolom pada data frame

In [347]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  9  6  1  5
1  9  7  6  8  6
2  1  6  8  6  9
3  2  6  9  1  5
4  3  8  3  3  2

In [348]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  4  9     6  1  5
1  9  7     6  8  6
2  1  6     8  6  9
3  2  6     9  1  5
4  3  8     3  3  2

In [349]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     4       9  6     1  5
1     9       7  6     8  6
2     1       6  8     6  9
3     2       6  9     1  5
4     3       8  3     3  2

# #07: Menghapus missing values pada data frame (NaN)

In [350]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  2JRmTvpPtE  1.388354 -0.173912       NaN -0.295430
1  N7LfRlmHGy  0.263744  0.730386 -0.834153  1.390615
2  qCf1HNmsUC  2.457350  1.563424 -1.495076  0.043498
3  SdzVu95hOL  0.008584 -0.668024       NaN -0.238399
4  VjhObyjLBW  0.733646  0.845331 -0.607183  3.226522

In [351]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  2JRmTvpPtE  1.388354 -0.173912       NaN -0.295430
1  N7LfRlmHGy  0.263744  0.730386 -0.834153  1.390615
2  qCf1HNmsUC  2.457350  1.563424 -1.495076  0.043498
3  SdzVu95hOL  0.008584 -0.668024       NaN -0.238399
4  VjhObyjLBW  0.733646  0.845331 -0.607183  3.226522

In [352]:
df_backup = df.copy(deep=True)

In [353]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  2JRmTvpPtE
1  N7LfRlmHGy
2  qCf1HNmsUC
3  SdzVu95hOL
4  VjhObyjLBW

In [354]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
1  N7LfRlmHGy  0.263744  0.730386 -0.834153  1.390615
2  qCf1HNmsUC  2.457350  1.563424 -1.495076  0.043498
4  VjhObyjLBW  0.733646  0.845331 -0.607183  3.226522
7  i6ynEynw0s  0.770696 -0.456604  1.821177 -0.573484
8  N0gyPQ40EB -0.478412 -0.658837 -0.672579 -1.968145

In [355]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.100000
C    0.066667
D    0.100000
dtype: float64

In [356]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         B         C         D
0  2JRmTvpPtE -0.173912       NaN -0.295430
1  N7LfRlmHGy  0.730386 -0.834153  1.390615
2  qCf1HNmsUC  1.563424 -1.495076  0.043498
3  SdzVu95hOL -0.668024       NaN -0.238399
4  VjhObyjLBW  0.845331 -0.607183  3.226522

# #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [357]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [358]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [359]:
type(df['A'])

pandas.core.series.Series

In [360]:
type(df)

pandas.core.frame.DataFrame

In [361]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [362]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [363]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [364]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

# #09: Membagi data frame menjadi dua secara acak

In [365]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  11  13   7  12   5
1  18  17  15  13   8
2   4   3   2  12   9
3   3   4  10   3  16
4  13  11  17   7  14
5   2  19  12  16   6
6  11  17  19  14   8
7  15  17  13   3   2
8   3  15  10   7  15
9  11   4  18  12   9

In [366]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [367]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [368]:
df_1

    A   B   C   D   E
9  11   4  18  12   9
5   2  19  12  16   6
4  13  11  17   7  14
7  15  17  13   3   2
3   3   4  10   3  16
6  11  17  19  14   8
8   3  15  10   7  15

In [369]:
df_2

    A   B   C   D  E
0  11  13   7  12  5
1  18  17  15  13  8
2   4   3   2  12  9

# #10: Mengganti nama (label) kolom pada data frame berdasarkan pola

In [370]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.columns = ['Pclass','Survival status','full Name','Sex ',' Age','Sib SP', 'parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [371]:
# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [372]:
# Memangkas kelebihan spasi pada nama kolom
df = df_backup.copy(deep=True)
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_') 
# Remark:
# str.lower() = merubah menjadi huruf kecil
# str.strip() = menghilangkan kelebihan sepasi di awal ataupun diakhir kata
# str.replace() = mengganti huruf
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# #11: Seleksi kolom dan baris pada data frame menggunakan loc

In [373]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  19   4  15   2   6
1   9  10   4   4  15
2   5   4  19   8  19
3   8  16  15  12   3
4   1   2   5  17   8
5   9  15  17  17  16
6   9  19  16  18   4
7   3  14  15   4   3
8  19   3  16  19   9
9   1  14  14  19  19

In [374]:
# Seleksi kolom dan baris menggunakan loc
df.loc[[0,3,4],['B','E']] #bagian pertama untuk baris, bagian kedua untuk kolom

    B  E
0   4  6
3  16  3
4   2  8

In [375]:
# Seleksi baris dengan kondisi
df.loc[df['B']>10,['B','D','E']]

    B   D   E
3  16  12   3
5  15  17  16
6  19  18   4
7  14   4   3
9  14  19  19

In [376]:
# Slicing data frame dengan loc
df.loc[0:4, 'B':'D'] #slicing pada loc dataframe start dan End index sifatnya inclusif artinya angka tersebut di turut sertakan | Slicing list hanya start index say inclusive

    B   C   D
0   4  15   2
1  10   4   4
2   4  19   8
3  16  15  12
4   2   5  17

# #12: Membentuk kolom bertipe datetime dari beberapa kolom lain pada pandas data frame

In [377]:
# Persiapan data frame
data = {'day':[1,2,10,25,12], 'month':[1,2,4,5,6], 'year':[2000,2001,2010,2015,2020]} #data dictionary
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [378]:
# Membentuk kolom bertipe datetime
df['penanggalan'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [379]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object

# #13: Konversi nilai numerik ke dalam kategori pada data frame

In [380]:
# Persiapan data frame
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)),columns=cols)
df

   usia
0    13
1    81
2    19
3    20
4     7
5     8
6    52
7    72
8    12
9    77

In [381]:
# Pengelompokan nilai numerik ke dalam beberapa kategori menggunakan cut()
df['kelompok_usia'] = pd.cut(df['usia'], bins=[0,18,65,99], labels=['anak','dewasa','manula'])
df

   usia kelompok_usia
0    13          anak
1    81        manula
2    19        dewasa
3    20        dewasa
4     7          anak
5     8          anak
6    52        dewasa
7    72        manula
8    12          anak
9    77        manula

# #14: Menggabungkan (merge) dua pandas data frame

In [382]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df.head()

    A   B   C   D   E
0   2   2   8   1  14
1   3  14   8   5   9
2   4   8  17   1   2
3   5   2  17  16  10
4  15   7   9   5   4

In [383]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

   A  B   C   D   E
0  2  2   8   1  14
2  4  8  17   1   2
3  5  2  17  16  10

In [384]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B   C  D  E
1   3  14   8  5  9
2   4   8  17  1  2
4  15   7   9  5  4

In [385]:
# MEnggabungkan dua data frame
df_inner = pd.merge(df1, df2, how='inner')
df_inner #Menghasilkan index baru

   A  B   C  D  E
0  4  8  17  1  2

In [386]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer # nilai duplikasi akan di hilangkan, mostly used in actual case

    A   B   C   D   E
0   2   2   8   1  14
1   4   8  17   1   2
2   5   2  17  16  10
3   3  14   8   5   9
4  15   7   9   5   4

# #15: Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada pandas data frame

In [387]:
# Persiapan data frame
data = {'nama':['Didi Kempot', 'Glen Fredly','Mbah Surip'], 'tempat_kelahiran':['Surakarta, jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama        tempat_kelahiran
0  Didi Kempot  Surakarta, jawa Tengah
1  Glen Fredly    Jakarta, DKI Jakarta
2   Mbah Surip   Mojokerto, Jawa Timur

In [388]:
# Memecah nama depan dan nama belakang
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama        tempat_kelahiran nama_depan nama_belakang
0  Didi Kempot  Surakarta, jawa Tengah       Didi        Kempot
1  Glen Fredly    Jakarta, DKI Jakarta       Glen        Fredly
2   Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [389]:
# Memecah nama kota dan propinsi
df[['kota','propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, jawa Tengah",Didi,Kempot,Surakarta,jawa Tengah
1,Glen Fredly,"Jakarta, DKI Jakarta",Glen,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

# #16: Menata ulang data frame dengan multiple indexes menggunakan unstack()

In [390]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [391]:
# Data frame dengan multiple indexes dari hasil gouping
df.groupby(['sex','pclass'])['survived'].mean().to_frame() #to_frame() digunakan untuk mempercantik tampilan dalam hal ini tabel

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [392]:
# Menata ulang data frame dengan multiple indexes
df.groupby(['sex','pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

# #17: Resampling pada data deret waktu (time series data)

In [393]:
# Persiapan data frame
n_rows = 365*24 #365 = 365 hari atau 1 tahun | 24 = 24 jam atau 1 hari
n_cols = 2
cols = ['col1','col2']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)), columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')  #deret waktu dalam jam
df

                     col1  col2
2000-01-01 00:00:00     9    16
2000-01-01 01:00:00    12     6
2000-01-01 02:00:00     1     1
2000-01-01 03:00:00    19     5
2000-01-01 04:00:00     6    16
...                   ...   ...
2000-12-30 19:00:00    12     3
2000-12-30 20:00:00    12     5
2000-12-30 21:00:00     6    11
2000-12-30 22:00:00    10    18
2000-12-30 23:00:00     1    16

[8760 rows x 2 columns]

In [394]:
# Resampling data dengan interval monthly
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7572
2000-02-29  6968
2000-03-31  7313
2000-04-30  6969
2000-05-31  7481
2000-06-30  7332
2000-07-31  7528
2000-08-31  7410
2000-09-30  7160
2000-10-31  7414
2000-11-30  7591
2000-12-31  6963

In [395]:
# Resampling data dengan interval daily
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   224
2000-01-02   204
2000-01-03   254
2000-01-04   221
2000-01-05   270
...          ...
2000-12-26   226
2000-12-27   275
2000-12-28   263
2000-12-29   190
2000-12-30   180

[365 rows x 1 columns]

# #18: Membentuk dummy data frame

In [396]:
# Membentuk data frame dari dictionary
pd.DataFrame({'col1':[1,2,3,4],'col2':[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [397]:
# Membentuk data frame dari numpy array
n_rows = 5
n_cols = 3

arr = np.random.randint(1,20,size=(n_rows,n_cols))
arr

array([[ 2,  4, 14],
       [18, 15, 18],
       [ 6,  6, 18],
       [15, 19,  8],
       [ 8,  7,  3]])

In [398]:
pd.DataFrame(arr,columns=tuple('ABC'))

    A   B   C
0   2   4  14
1  18  15  18
2   6   6  18
3  15  19   8
4   8   7   3

In [399]:
# Membentuk data frame dengan memanfaatkan pandas.util.testing
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
4WgWfeu0MG  1.241002 -0.111559 -0.810535  0.847068
NRmHf7enab -0.487016  1.896818 -0.237166 -1.039093
ayh0s5qhMY  1.638447  0.093828 -0.136901  0.644115
P936588n5E -0.206934  0.174146  0.541214 -1.077273
zDWV6Ux1oX  0.175944 -1.522877 -1.730264 -1.086991

In [400]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [401]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  0.272589 -1.622248  0.624885  0.782126
2000-01-04  1.038558  0.120676  0.267585  1.899637
2000-01-05  0.361920 -0.022704 -2.219492 -1.185925
2000-01-06  0.543078 -0.319992  0.038988  0.190783
2000-01-07  0.315293  0.265764 -0.580571  1.027256

In [402]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
zUvuMSKTcY  1.047024  2.993384  1.166987 -1.749124
yGhVLKw0on  0.017444  1.544275  0.573377  0.900763
wfAcoWRfIk  0.854240 -1.524889 -1.188203       NaN
OsoQhxH8H5  0.256344 -1.875025 -0.122726 -0.012372
4xaS2q7aHB -0.418372       NaN  0.243457 -0.749709

# #19: Formating tampilan data frame

In [403]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['omset','operational']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)), columns=cols)
df

   omset  operational
0      1            8
1      1            8
2      8           12
3     17           11
4     16            1

In [404]:
df['omset'] = df['omset']*100_000
df['operational'] = df['operational']*10_000
df

     omset  operational
0   100000        80000
1   100000        80000
2   800000       120000
3  1700000       110000
4  1600000        10000

In [405]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operational
0 2000-01-01   100000        80000
1 2000-01-02   100000        80000
2 2000-01-03   800000       120000
3 2000-01-04  1700000       110000
4 2000-01-05  1600000        10000

In [406]:
# Melakukan formatting tampilan data frame
formatku = {'tanggal':'{:%d/%m/%y}','operational':'Rp. {:.2f}','omset':'Rp. {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [407]:
type(laporan) #type laporn bukan object dataframe tapi styler

pandas.io.formats.style.Styler

In [408]:
laporan.hide_index()

In [409]:
laporan.set_caption('Data omset dan operational')

In [410]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operational', color='lightblue')
laporan.highlight_max('operational', color='grey')

# #20: Menggabungkan (merge) dua data frame secara berdampingan

In [411]:
# Persiapan data frame
d1 = {'col1':[1,2,3],'col2':[10,20,30]}
df1 = pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [412]:
d2 = {'col3':[4,5,6],'col4':[40,50,60]}
df2 = pd.DataFrame(d2)
df2

   col3  col4
0     4    40
1     5    50
2     6    60

In [413]:
# Menggabungkan (merge) dua data frame secara berdampingan
df = pd.merge(df1,df2,left_index=True,right_index=True)
df

   col1  col2  col3  col4
0     1    10     4    40
1     2    20     5    50
2     3    30     6    60

# #21: Agregasi pada pandas data frame dengan agg()

In [414]:
# Persiapan data frame
df = pd.read_csv('./Dataset/Iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [415]:
# Mengenal groupby() dan fungsi agregasi
df.groupby('Species')['PetalLengthCm'].count().to_frame()

                 PetalLengthCm
Species
Iris-setosa                 50
Iris-versicolor             50
Iris-virginica              50

In [416]:
df.groupby('Species')['PetalLengthCm'].mean().to_frame()

                 PetalLengthCm
Species
Iris-setosa              1.464
Iris-versicolor          4.260
Iris-virginica           5.552

In [417]:
df.groupby('Species')['PetalLengthCm'].median().to_frame()

                 PetalLengthCm
Species
Iris-setosa               1.50
Iris-versicolor           4.35
Iris-virginica            5.55

In [418]:
# Agregasi dengan agg()
df.groupby('Species')['PetalLengthCm'].agg(['count','mean','median'])

                 count   mean  median
Species
Iris-setosa         50  1.464    1.50
Iris-versicolor     50  4.260    4.35
Iris-virginica      50  5.552    5.55

In [419]:
# Agregasi dengan describe
df.groupby('Species')['PetalLengthCm'].describe()

                 count   mean       std  min  25%   50%    75%  max
Species
Iris-setosa       50.0  1.464  0.173511  1.0  1.4  1.50  1.575  1.9
Iris-versicolor   50.0  4.260  0.469911  3.0  4.0  4.35  4.600  5.1
Iris-virginica    50.0  5.552  0.551895  4.5  5.1  5.55  5.875  6.9

# #22: Memantau penggunaan memory pada data frame

In [420]:
# Persiapan data frame
df_titanic = pd.read_csv('./Dataset/titanicfull.csv')
df_titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [421]:
df_iris = pd.read_csv('./Dataset/Iris.csv')
df_iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [422]:
# Memantau penggunaan memory suatu data frame
df_titanic.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   name      1309 non-null   object
 3   sex       1309 non-null   object
 4   age       1046 non-null   float64
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   ticket    1309 non-null   object
 8   fare      1308 non-null   float64
 9   cabin     295 non-null    object
 10  embarked  1307 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 452.7 KB

In [423]:
df_iris.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 16.3 KB

In [424]:
# Memantau penggunaan memory untuk setiap kolom dari suatu data frame
df_titanic.memory_usage(deep=True) #Satuan yang digunakan adalah byte

Index          128
pclass       10472
survived     10472
name        110127
sex          80781
age          10472
sibsp        10472
parch        10472
ticket       83502
fare         10472
cabin        50366
embarked     75870
dtype: int64

In [425]:
df_iris.memory_usage(deep=True)

Index              128
Id                1200
SepalLengthCm     1200
SepalWidthCm      1200
PetalLengthCm     1200
PetalWidthCm      1200
Species          10550
dtype: int64

# #23: Seleksi baris pada data frame dengan query()

In [426]:
# Persiapan data frame
d = {'kolom_satu': [1,2,3,4,5],'kolom dua': [10,20,30,40,50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

In [427]:
# Seleksi baris dengan query()
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [428]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50

# #24: UTC dan konversi zona waktu (time zone) pada python pandas

In [429]:
# Persiapan series
#                   Start val,  End Val., Steper
s = pd.Series(range(1591683521,1592201921,3600))
s = pd.to_datetime(s, unit='s')
s.head()

0   2020-06-09 06:18:41
1   2020-06-09 07:18:41
2   2020-06-09 08:18:41
3   2020-06-09 09:18:41
4   2020-06-09 10:18:41
dtype: datetime64[ns]

## [Epoch/Unix Time](https://en.wikipedia.org/wiki/Unix_time)
## [Epoch Time Converter](https://www.epochconverter.com/)

In [430]:
# Pengaturan zona waktu (time zone)
s = s.dt.tz_localize('UTC')
s.head()

0   2020-06-09 06:18:41+00:00
1   2020-06-09 07:18:41+00:00
2   2020-06-09 08:18:41+00:00
3   2020-06-09 09:18:41+00:00
4   2020-06-09 10:18:41+00:00
dtype: datetime64[ns, UTC]

In [432]:
s = s.dt.tz_convert('Asia/Jakarta')
s.head()

0   2020-06-09 13:18:41+07:00
1   2020-06-09 14:18:41+07:00
2   2020-06-09 15:18:41+07:00
3   2020-06-09 16:18:41+07:00
4   2020-06-09 17:18:41+07:00
dtype: datetime64[ns, Asia/Jakarta]

In [433]:
s = s.dt.tz_convert('Australia/Hobart')
s.head()

0   2020-06-09 16:18:41+10:00
1   2020-06-09 17:18:41+10:00
2   2020-06-09 18:18:41+10:00
3   2020-06-09 19:18:41+10:00
4   2020-06-09 20:18:41+10:00
dtype: datetime64[ns, Australia/Hobart]

# #25: Pengaturan tampilan pada python pandas